; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-40)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 ball38 ball39 ball40 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(ball ball38)
(ball ball39)
(ball ball40)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at ball30 rooma)
(at ball31 rooma)
(at ball32 rooma)
(at ball33 rooma)
(at ball34 rooma)
(at ball35 rooma)
(at ball36 rooma)
(at ball37 rooma)
(at ball38 rooma)
(at ball39 rooma)
(at ball40 rooma)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room4)
(at ball31 room4)
(at ball32 room4)
(at ball33 room4)
(at ball34 room5)
(at ball35 room5)
(at ball36 room5)
(at ball37 room5)
(at ball38 room5)
(at ball39 room5)
(at ball40 room5)
)
)
)

; plan
1. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 8 of 40
2. (pick ball40 rooma right)
   deleted: (at ball40 rooma) (free right)
   added: (carry ball40 right)
   goals met: 8 of 40
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 8 of 40
4. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 9 of 40
5. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 9 of 40
6. (drop ball40 room5 right)
   deleted: (carry ball40 right)
   added: (at ball40 room5) (free right)
   goals met: 10 of 40
7. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 10 of 40
8. (pick ball39 rooma left)
   deleted: (at ball39 rooma) (free left)
   added: (carry ball39 left)
   goals met: 10 of 40
9. (pick ball38 rooma right)
   deleted: (at ball38 rooma) (free right)
   added: (carry ball38 right)
   goals met: 10 of 40
10. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 10 of 40
11. (drop ball38 room5 right)
   deleted: (carry ball38 right)
   added: (at ball38 room5) (free right)
   goals met: 11 of 40
12. (drop ball39 room5 left)
   deleted: (carry ball39 left)
   added: (at ball39 room5) (free left)
   goals met: 12 of 40
13. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 12 of 40
14. (pick ball37 rooma left)
   deleted: (at ball37 rooma) (free left)
   added: (carry ball37 left)
   goals met: 12 of 40
15. (pick ball36 rooma right)
   deleted: (at ball36 rooma) (free right)
   added: (carry ball36 right)
   goals met: 12 of 40
16. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 12 of 40
17. (drop ball36 room5 right)
   deleted: (carry ball36 right)
   added: (at ball36 room5) (free right)
   goals met: 13 of 40
18. (drop ball37 room5 left)
   deleted: (carry ball37 left)
   added: (at ball37 room5) (free left)
   goals met: 14 of 40
19. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 14 of 40
20. (pick ball35 rooma left)
   deleted: (at ball35 rooma) (free left)
   added: (carry ball35 left)
   goals met: 14 of 40
21. (pick ball34 rooma right)
   deleted: (at ball34 rooma) (free right)
   added: (carry ball34 right)
   goals met: 14 of 40
22. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 14 of 40
23. (drop ball34 room5 right)
   deleted: (carry ball34 right)
   added: (at ball34 room5) (free right)
   goals met: 15 of 40
24. (drop ball35 room5 left)
   deleted: (carry ball35 left)
   added: (at ball35 room5) (free left)
   goals met: 16 of 40
25. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 16 of 40
26. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 16 of 40
27. (pick ball33 rooma left)
   deleted: (at ball33 rooma) (free left)
   added: (carry ball33 left)
   goals met: 16 of 40
28. (pick ball32 rooma right)
   deleted: (at ball32 rooma) (free right)
   added: (carry ball32 right)
   goals met: 16 of 40
29. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 16 of 40
30. (drop ball32 room4 right)
   deleted: (carry ball32 right)
   added: (at ball32 room4) (free right)
   goals met: 17 of 40
31. (drop ball33 room4 left)
   deleted: (carry ball33 left)
   added: (at ball33 room4) (free left)
   goals met: 18 of 40
32. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 18 of 40
33. (pick ball31 rooma left)
   deleted: (at ball31 rooma) (free left)
   added: (carry ball31 left)
   goals met: 18 of 40
34. (pick ball30 rooma right)
   deleted: (at ball30 rooma) (free right)
   added: (carry ball30 right)
   goals met: 18 of 40
35. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 18 of 40
36. (drop ball30 room4 right)
   deleted: (carry ball30 right)
   added: (at ball30 room4) (free right)
   goals met: 19 of 40
37. (drop ball31 room4 left)
   deleted: (carry ball31 left)
   added: (at ball31 room4) (free left)
   goals met: 20 of 40
38. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 20 of 40
39. (pick ball29 rooma left)
   deleted: (at ball29 rooma) (free left)
   added: (carry ball29 left)
   goals met: 20 of 40
40. (pick ball28 rooma right)
   deleted: (at ball28 rooma) (free right)
   added: (carry ball28 right)
   goals met: 20 of 40
41. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 20 of 40
42. (drop ball28 room4 right)
   deleted: (carry ball28 right)
   added: (at ball28 room4) (free right)
   goals met: 21 of 40
43. (drop ball29 room4 left)
   deleted: (carry ball29 left)
   added: (at ball29 room4) (free left)
   goals met: 22 of 40
44. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 22 of 40
45. (pick ball27 rooma left)
   deleted: (at ball27 rooma) (free left)
   added: (carry ball27 left)
   goals met: 22 of 40
46. (pick ball26 rooma right)
   deleted: (at ball26 rooma) (free right)
   added: (carry ball26 right)
   goals met: 22 of 40
47. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 22 of 40
48. (drop ball26 room4 right)
   deleted: (carry ball26 right)
   added: (at ball26 room4) (free right)
   goals met: 23 of 40
49. (drop ball27 room4 left)
   deleted: (carry ball27 left)
   added: (at ball27 room4) (free left)
   goals met: 24 of 40
50. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 24 of 40
51. (pick ball25 rooma left)
   deleted: (at ball25 rooma) (free left)
   added: (carry ball25 left)
   goals met: 24 of 40
52. (pick ball24 rooma right)
   deleted: (at ball24 rooma) (free right)
   added: (carry ball24 right)
   goals met: 24 of 40
53. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 24 of 40
54. (drop ball24 room4 right)
   deleted: (carry ball24 right)
   added: (at ball24 room4) (free right)
   goals met: 25 of 40
55. (drop ball25 room4 left)
   deleted: (carry ball25 left)
   added: (at ball25 room4) (free left)
   goals met: 26 of 40
56. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 26 of 40
57. (pick ball23 rooma left)
   deleted: (at ball23 rooma) (free left)
   added: (carry ball23 left)
   goals met: 26 of 40
58. (pick ball22 rooma right)
   deleted: (at ball22 rooma) (free right)
   added: (carry ball22 right)
   goals met: 26 of 40
59. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 26 of 40
60. (drop ball23 room4 left)
   deleted: (carry ball23 left)
   added: (at ball23 room4) (free left)
   goals met: 27 of 40
61. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 27 of 40
62. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 27 of 40
63. (drop ball22 room3 right)
   deleted: (carry ball22 right)
   added: (at ball22 room3) (free right)
   goals met: 28 of 40
64. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 28 of 40
65. (pick ball21 rooma left)
   deleted: (at ball21 rooma) (free left)
   added: (carry ball21 left)
   goals met: 28 of 40
66. (pick ball20 rooma right)
   deleted: (at ball20 rooma) (free right)
   added: (carry ball20 right)
   goals met: 28 of 40
67. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 28 of 40
68. (drop ball20 room3 right)
   deleted: (carry ball20 right)
   added: (at ball20 room3) (free right)
   goals met: 29 of 40
69. (drop ball21 room3 left)
   deleted: (carry ball21 left)
   added: (at ball21 room3) (free left)
   goals met: 30 of 40
70. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 30 of 40
71. (pick ball19 rooma left)
   deleted: (at ball19 rooma) (free left)
   added: (carry ball19 left)
   goals met: 30 of 40
72. (pick ball18 rooma right)
   deleted: (at ball18 rooma) (free right)
   added: (carry ball18 right)
   goals met: 30 of 40
73. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 30 of 40
74. (drop ball18 room3 right)
   deleted: (carry ball18 right)
   added: (at ball18 room3) (free right)
   goals met: 31 of 40
75. (drop ball19 room3 left)
   deleted: (carry ball19 left)
   added: (at ball19 room3) (free left)
   goals met: 32 of 40
76. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 32 of 40
77. (pick ball17 rooma left)
   deleted: (at ball17 rooma) (free left)
   added: (carry ball17 left)
   goals met: 32 of 40
78. (pick ball16 rooma right)
   deleted: (at ball16 rooma) (free right)
   added: (carry ball16 right)
   goals met: 32 of 40
79. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 32 of 40
80. (drop ball16 room3 right)
   deleted: (carry ball16 right)
   added: (at ball16 room3) (free right)
   goals met: 33 of 40
81. (drop ball17 room3 left)
   deleted: (carry ball17 left)
   added: (at ball17 room3) (free left)
   goals met: 34 of 40
82. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 34 of 40
83. (pick ball15 rooma left)
   deleted: (at ball15 rooma) (free left)
   added: (carry ball15 left)
   goals met: 34 of 40
84. (pick ball14 rooma right)
   deleted: (at ball14 rooma) (free right)
   added: (carry ball14 right)
   goals met: 34 of 40
85. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 34 of 40
86. (drop ball14 room3 right)
   deleted: (carry ball14 right)
   added: (at ball14 room3) (free right)
   goals met: 35 of 40
87. (drop ball15 room3 left)
   deleted: (carry ball15 left)
   added: (at ball15 room3) (free left)
   goals met: 36 of 40
88. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 36 of 40
89. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 36 of 40
90. (pick ball13 rooma left)
   deleted: (at ball13 rooma) (free left)
   added: (carry ball13 left)
   goals met: 36 of 40
91. (pick ball12 rooma right)
   deleted: (at ball12 rooma) (free right)
   added: (carry ball12 right)
   goals met: 36 of 40
92. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 36 of 40
93. (drop ball12 roomb right)
   deleted: (carry ball12 right)
   added: (at ball12 roomb) (free right)
   goals met: 37 of 40
94. (drop ball13 roomb left)
   deleted: (carry ball13 left)
   added: (at ball13 roomb) (free left)
   goals met: 38 of 40
95. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 38 of 40
96. (pick ball11 rooma left)
   deleted: (at ball11 rooma) (free left)
   added: (carry ball11 left)
   goals met: 38 of 40
97. (pick ball10 rooma right)
   deleted: (at ball10 rooma) (free right)
   added: (carry ball10 right)
   goals met: 38 of 40
98. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 38 of 40
99. (drop ball11 roomb left)
   deleted: (carry ball11 left)
   added: (at ball11 roomb) (free left)
   goals met: 39 of 40
100. (drop ball10 roomb right)
   deleted: (carry ball10 right)
   added: (at ball10 roomb) (free right)
   goals met: 40 of 40
